BUI.use(['bui/list', 'bui/grid', 'bui/data'], function (List, Grid, Data) {

    //工作台	
    var items = [
            {
                title: '使用帮助',
                text: '查看详情',
                icon: 'help',
                url: ''
            },
            {
                title: '系统架构图',
                text: '查看详情',
                icon: 'composition',
                url: ''
            },
            {
                title: '我的工作台',
                text: '查看详情',
                icon: 'work',
                url: ''
            },
            {
                title: '2014-02-12',
                text: '查看详情',
                icon: 'weather',
                url: ''
            }
        ],
        tpl = [
            '<li class="bui-list-item">',
            '<div class="demo-list-content  {icon}">',
            '<div class="demo-list-icon {icon}"></div>',
            '<div class="demo-list-des">',
            '<h3>{title}</h3>',
            '<a href="#" class="demo-list-icon-right">{text}</a>',
            '</div>',
            '</div>',
            '</li>'
        ];
    list = new List.SimpleList({
        render: '#list1',
        elCls: 'demo-list clearfix ',
        items: items,
        itemTpl: tpl.join('')
    });
    list.render();

    list.on("itemclick", function (ev) {
        if ($(ev.domTarget).hasClass("demo-list-icon-right"))
            alert(ev.item['title']);
    });

    var Store = Data.Store,
        columns = [
            {
                title: '当事人类型', dataIndex: '1', width: 200, renderer: function (value, obj) {


                return '<a href="individualCustomers.html" >' + value + '</a>';
            }
            },
            {title: '当事人角色', dataIndex: '2', width: 100},
            {title: '姓名', dataIndex: '3', width: 100},
            {title: '证件类型', dataIndex: '4', width: 100},
            {title: '证件号码', dataIndex: '5', width: 200},
            {title: '渠道类型', dataIndex: '6', width: 100},
            {title: '渠道姓名', dataIndex: '7', width: 100}
        ];

    var data = [
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'},
        {'1': '个人', '2': '个人客户', '3': 'kunhn', '4': '身份证', '5': '1111111111', '6': '淘宝', '7': '淘宝', '8': '12032'}
    ];
    var store = new Store({
            data: data, pageSize: 30,
            autoLoad: true //自动加载数据
        }),
        grid = new Grid.Grid({
            render: '#grid',
            columns: columns,
            width: '100%',
            loadMask: true, //加载数据时显示屏蔽层
            store: store,
            bbar: {
                // pagingBar:表明包含分页栏
                pagingBar: true
            }
        });

    grid.render();
});